app/controllers/sessions_controller.rb

 def create
 	user = Socio.find_by(email: params[:eemail])
---
SELECT  `socios`.* FROM `socios` WHERE `socios`.`eemail` = 'giovani.hbertuzzo@gmail.com' LIMIT 1