app/controllers/socios_controller.rb

  def index
    @socios = Socio.all
---
SELECT `socios`.* FROM `socios`

  def create
    @socio = Socio.new(socio_params)

    respond_to do |format|
      if @socio.save
---
INSERT INTO `socios` (`nome`, `cpf`, `email`, `telefone`, `endereco`, `sexo`, `cadeira`, `password_digest`, `permissao`, `dataNascimento`, `created_at`, `updated_at`) VALUES ('admin', 32615744453, 'admin@admin.com.br', 449999999, 'RUA AVENIDA', 'Masculino', 4, 'admin', 1, '2016-11-08', '2016-11-08 23:12:00', '2016-11-08 23:12:00')

  def update
    respond_to do |format|
      if @socio.update(socio_params)
---
UPDATE `socios` SET `email` = 'outlook.com.brblablablablablabal', `updated_at` = '2016-10-27 22:05:00' WHERE `socios`.`id` = 1

  def destroy
    @socio.destroy
---
DELETE FROM `socios` WHERE `socios`.`id` = 1

    def set_socio
      @socio = Socio.find(params[:id])
---
SELECT  `socios`.* FROM `socios` WHERE `socios`.`id` = 4 LIMIT 1