app/controllers/transacao_entradas_controller.rb

  def index
    @transacao_entradas = TransacaoEntrada.all
---
SELECT `transacao_entradas`.* FROM `transacao_entradas`

  def create
    @transacao_entrada = TransacaoEntrada.new(transacao_entrada_params)

    respond_to do |format|
      if @transacao_entrada.save
---
INSERT INTO `transacao_entradas` (`valor`, `justifica_entrada`, `tipo`, `data_entrada`, `created_at`, `updated_at`) VALUES (52.0, 'dsadsadasdsad', 'Outro', '2016-11-10', '2016-11-10 18:38:00', '2016-11-10 18:38:00')

  def update
    respond_to do |format|
      if @transacao_entrada.update(transacao_entrada_params)
---
UPDATE `transacao_entradas` SET `justifica_entrada` = 'gdsgs', `updated_at` = '2016-11-22 22:44:50' WHERE `transacao_entradas`.`id` = 1

  def destroy
    @transacao_entrada.destroy
---
DELETE FROM `transacao_entradas` WHERE `transacao_entradas`.`id` = 1

    def set_transacao_entrada
      @transacao_entrada = TransacaoEntrada.find(params[:id])
---
SELECT  `transacao_entradas`.* FROM `transacao_entradas` WHERE `transacao_entradas`.`id` = 1 LIMIT 1