app/controllers/transacao_saidas_controller.rb

SELECT `transacao_saidas`.* FROM `transacao_saidas`
---
  def index
    @transacao_saidas = TransacaoSaida.all

INSERT INTO `transacao_saidas` (`id_saida`, `valor`, `justifica_saida`, `img_comprov_file_name`, `img_comprov_content_type`, `img_comprov_file_size`, `img_comprov_updated_at`, `data_saida`, `created_at`, `updated_at`) VALUES (10, 50.0, 'sdsdsadsadsa', 'Captura_de_tela_de_2016-11-04_18-38-43.png', 'image/png', 156439, '2016-11-04 20:38:50', '2016-11-04', '2016-11-04 20:38:00', '2016-11-04 20:38:00')
---
  def create
    @transacao_saida = TransacaoSaida.new(transacao_saida_params)

    respond_to do |format|
      if @transacao_saida.save

UPDATE `transacao_saidas` SET `img_comprov_updated_at` = '2016-11-10 22:21:03', `img_comprov_file_name` = 'DSC05298.JPG', `updated_at` = '2016-11-10 22:21:03' WHERE `transacao_saidas`.`id` = 1
---
  def update
    respond_to do |format|
      if @transacao_saida.update(transacao_saida_params)

DELETE FROM `transacao_saidas` WHERE `transacao_saidas`.`id` = 1
---
  def destroy
    @transacao_saida.destroy

SELECT  `transacao_saidas`.* FROM `transacao_saidas` WHERE `transacao_saidas`.`id` = 2 LIMIT 1
---
    def set_transacao_saida
      @transacao_saida = TransacaoSaida.find(params[:id])